Revit 2027 API
BuiltInFailures.CurveFailures.TooShort Property
 Line is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooShort { get; }
Public Shared ReadOnly Property TooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooShort {
	FailureDefinitionId^ get ();
}
static member TooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace